# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
sp = [2, 3, 5, 6]
sp2 = []
for i in range(len(sp)):
    if i % 2 != 0:
        sp2.append(sp[1] * sp[-2])
    else:
        sp2.append(sp[0] * sp[-1])
      
   
print(sp2)